TestCases/arcBuilding/Main/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "arcTop1|arcTop2|arcTop3|arcTop4|arcTop5|arcTop6|arcBot1|arcBot2|arcBot3|arcBot4|arcBot5|arcBot6"
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    "wall|arcStart"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    outlet
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }

	inlet
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }

    
    defaultFaces
    {
        type            empty;
    }
    
    "overTop1|overTop2|overTop3|overTop4|overTop5|overTop6|overBot1|overBot2|overBot3|overBot4|overBot5|overBot6|arcEndTop|arcEndBot"
    {
        type            overset;
    }
}


// ************************************************************************* //
