TestCases/arcBuilding/Main/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    ".*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

	inlet
	{
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.03;
        value       	uniform 0.1;  
	}

	outlet
	{
        type            inletOutlet;
		inletValue		$internalField;
		value			$internalField;
    }
    
    "overTop1|overTop2|overTop3|overTop4|overTop5|overTop6|overBot1|overBot2|overBot3|overBot4|overBot5|overBot6|arcEndTop|arcEndBot"
    {
        type            overset;
    }
	
}

// ************************************************************************* //
