TestCases/arcBuilding/Main/0/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1320
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    arcTop6
    {
        type            zeroGradient;
    }
    arcEndTop
    {
        type            overset;
        value           uniform 1;
    }
    overTop6
    {
        type            overset;
        value           uniform 1;
    }
    overTop5
    {
        type            overset;
        value           uniform 1;
    }
    arcTop5
    {
        type            zeroGradient;
    }
    overTop4
    {
        type            overset;
        value           uniform 1;
    }
    arcTop4
    {
        type            zeroGradient;
    }
    overTop3
    {
        type            overset;
        value           uniform 1;
    }
    arcTop3
    {
        type            zeroGradient;
    }
    overTop2
    {
        type            overset;
        value           uniform 1;
    }
    arcTop2
    {
        type            zeroGradient;
    }
    overTop1
    {
        type            overset;
        value           uniform 1;
    }
    arcTop1
    {
        type            zeroGradient;
    }
    arcStart
    {
        type            zeroGradient;
    }
    arcBot1
    {
        type            zeroGradient;
    }
    overBot1
    {
        type            overset;
        value           uniform 1;
    }
    arcBot2
    {
        type            zeroGradient;
    }
    overBot2
    {
        type            overset;
        value           uniform 1;
    }
    arcBot3
    {
        type            zeroGradient;
    }
    overBot3
    {
        type            overset;
        value           uniform 1;
    }
    arcBot4
    {
        type            zeroGradient;
    }
    overBot4
    {
        type            overset;
        value           uniform 1;
    }
    overBot5
    {
        type            overset;
        value           uniform 1;
    }
    arcBot5
    {
        type            zeroGradient;
    }
    arcEndBot
    {
        type            overset;
        value           uniform 1;
    }
    overBot6
    {
        type            overset;
        value           uniform 1;
    }
    arcBot6
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
